# pz_3_2.py
def calculate_interest_rate(deposit):
    """
    При открытии вклада в банке установлены следующие годовые проценты: при
    вкладе до 50000р. процент составит 4%; при вкладе от 50000р. до 100000р. процент
    составит 5%; при вкладе от 100000р. до 150000р. скидка составит 6%; при вкладе от
    150000 р. до 200000 р. процент составит 7%. Составить программу, определяющую
    процентной ставки в зависимости от вносимой суммы.
    """
    try:
        if deposit < 50000:
            return "Процентная ставка: 4%"
        elif 50000 <= deposit < 100000:
            return "Процентная ставка: 5%"
        elif 100000 <= deposit < 150000:
            return "Процентная ставка: 6%"
        elif 150000 <= deposit <= 200000:
            return "Процентная ставка: 7%"
        else:
            return "Вклад превышает лимит (200000 рублей)"
    except Exception as e:
        return f"Ошибка: {e}"

if __name__ == "__main__":
    try:
        # Ввод суммы вклада
        deposit = float(input("Введите сумму вклада: "))
        print(calculate_interest_rate(deposit))
    except ValueError:
        print("Ошибка: Введите корректную сумму вклада.")
